import pandas as pd
import numpy as np
from datetime import datetime
from datetime import timedelta
from math import sin, asin, cos, radians, fabs, sqrt
from epointml.utils import DbPoolUtil
def data_extract(df,df1):
    df.columns = ['year(发现时间)', '结果满意度', '案件大类', '街镇', '数量']

    list_s = ['社会管理类', '建设交通类', '公安政法类', '科教文卫类', '安全监管类', '经济综合类', '社会团体类', '公用事业类', '其他类']

    df.dropna(subset=["案件大类", "结果满意度", "街镇"], inplace=True)

    df['案件大类'].loc[df[df['案件大类'] == '国有档案']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '个人档案']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '商业服务']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '工商监管']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '工商信息']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '违法经营']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '合作交流']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '服务质量']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '旅游纠纷']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '旅游信息']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '生活保障']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '救灾赈灾']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '优抚安置']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '社区家政']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '养老保障']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '慈善福利']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '殡葬事业']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '婚姻管理']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '寺庙管理']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '宗教信仰']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '侨务工作']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '统战工作']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '就业创业']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '劳动保护']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '社保信息']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '劳动人事制度']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '医疗医保']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '工伤']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '津贴补助']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '社会保险']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '外事工作']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '知识产权']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '道路维护']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '公共道路']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '工程管理']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '违法建筑']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '燃气行业监管']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '污染']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '夜间施工许可']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '驾驶培训']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '车辆拍卖']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '公交巴士']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '铁路客运']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '地铁客运']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '出租车']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '港船客运']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '航空客运']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '汽车客运']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '货物运输']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '汽车维修']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '公共交通用卡管理']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '停车管理']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '口岸协调']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '口岸信息']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '禽类饲养']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '环境卫生']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '城市管理']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '市容市貌']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '绿地绿化']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '动植园林']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '民防工程']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '防灾抗灾']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '水资源管理']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '排水排污管理']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '河道流域管理']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '城市建设用地管理']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '非城市建设用地管理']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '建设管理']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '土地资源管理']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '房屋权属']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '旧房改造']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '保障型住房']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '物业服务管理']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '市场交易管理']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '征收管理']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '住房病虫害']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '物业相关执法']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '财政工作']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '改革规划']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '价格调控']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '国资']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '金融']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '经济信息化']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '村队管理']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '农业生产']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '动植物防疫']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '农民负担']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '商务']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '审计工作']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '税收政策']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '税收管理']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '统计工作']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '招生考试']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '学校管理']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '学生负担']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '入学入托']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '科技开发']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '科技管理']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '体育管理']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '医院监管']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '卫生信息']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '医疗服务']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '特定医疗机构']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '人口计生']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '广播影视']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '文化产业管理']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '文化遗产保护']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '新闻报道']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '刊物市场监管']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '法院受理']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '法院信息']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '护照办理']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '签证签注']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '出境咨询']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '行政管理']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '消防管理']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '消防设备维护']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '审批许可']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '社会噪声']['案件大类'].index] = '环境保护'
    df['案件大类'].loc[df[df['案件大类'] == '交通管理']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '户籍管理']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '犬类管理']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '社会治安']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '特种行业管理']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '国家安全']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '检察院受理']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '法律服务']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '公证服务']['案件大类'].index] = '文化生活'
    df['案件大类'].loc[df[df['案件大类'] == '纠纷仲裁']['案件大类'].index] = '经济发展'
    df['案件大类'].loc[df[df['案件大类'] == '司法直属']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '故障报修']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '限电管理']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '用电计费']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '电力服务']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '违规用电']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '供水报修']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '自来水水质']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '供水计费']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '供水服务']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '违规用水']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '气象预报']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '气象预警']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '燃气报修']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '燃气计费']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '燃气服务']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '通信']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '邮政服务']['案件大类'].index] = '民生保障'
    df['案件大类'].loc[df[df['案件大类'] == '妇联']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '其他社团']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '团市委']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '总工会']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '安全生产']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '职业健康']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '安全管理']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '广告审批']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '申诉举报']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '计量器具检测']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '生产许可证管理']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '特种设备监察']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '组织机构代码证']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '质量认证']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '表扬感谢']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '投诉批评']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '意见建议']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '传真信息']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '12345热线']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '表扬承办部门']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '批评承办部门']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '部队']['案件大类'].index] = '安全管理'
    df['案件大类'].loc[df[df['案件大类'] == '残联']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '工青妇工作']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '机关事务管理']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '纪检监查']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '政风行风']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '无效电话']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '涉港澳台']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '其他']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '咨询信访渠道']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '查询办理进度']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '复查复核']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '事项办理']['案件大类'].index] = '社会服务'
    df['案件大类'].loc[df[df['案件大类'] == '中央直属']['案件大类'].index] = '社会服务'

    df.sort_values('街镇', inplace=True)

    df.drop(df[df['结果满意度'] == '未表态'].index, inplace=True)

    df.drop(df[df['year(发现时间)'] == 2017].index, inplace=True)



    list_ = ['环境保护', '民生保障', '社会服务', '安全管理', '文化生活', '经济发展']
    list_street = ['五里桥街道', '半淞园街道', '南京东路街道', '外滩街道', '小东门街道', '打浦桥街道', '淮海中路街道', '瑞金二路街道', '老西门街道', '豫园街道']

    
    list1 = []
    for j in range(2018, datetime.now().year + 1):
        for n in list_street:
            for i in list_:
                a = (df[df['结果满意度'] == '一般'][df[df['结果满意度'] == '一般']['案件大类'] == i][
                         df[df['结果满意度'] == '一般'][df[df['结果满意度'] == '一般']['案件大类'] == i]['year(发现时间)'] == j][
                         df[df['结果满意度'] == '一般'][df[df['结果满意度'] == '一般']['案件大类'] == i][
                             df[df['结果满意度'] == '一般'][df[df['结果满意度'] == '一般']['案件大类'] == i]['year(发现时间)'] == j][
                             '街镇'] == n]['数量'].sum() * 0.6 +
                     df[df['结果满意度'] == '基本满意'][df[df['结果满意度'] == '基本满意']['案件大类'] == i][
                         df[df['结果满意度'] == '基本满意'][df[df['结果满意度'] == '基本满意']['案件大类'] == i]['year(发现时间)'] == j][
                         df[df['结果满意度'] == '基本满意'][df[df['结果满意度'] == '基本满意']['案件大类'] == i][
                             df[df['结果满意度'] == '基本满意'][df[df['结果满意度'] == '基本满意']['案件大类'] == i]['year(发现时间)'] == j][
                             '街镇'] == n]['数量'].sum() * 0.8 +
                     df[df['结果满意度'] == '满意'][df[df['结果满意度'] == '满意']['案件大类'] == i][
                         df[df['结果满意度'] == '满意'][df[df['结果满意度'] == '满意']['案件大类'] == i]['year(发现时间)'] == j][
                         df[df['结果满意度'] == '满意'][df[df['结果满意度'] == '满意']['案件大类'] == i][
                             df[df['结果满意度'] == '满意'][df[df['结果满意度'] == '满意']['案件大类'] == i]['year(发现时间)'] == j][
                             '街镇'] == n]['数量'].sum()) / (df[df['结果满意度'] == '一般'][df[df['结果满意度'] == '一般']['案件大类'] == i][
                                                             df[df['结果满意度'] == '一般'][
                                                                 df[df['结果满意度'] == '一般']['案件大类'] == i][
                                                                 'year(发现时间)'] == j][df[df['结果满意度'] == '一般'][
                                                                                         df[df['结果满意度'] == '一般'][
                                                                                             '案件大类'] == i][
                                                                                         df[df['结果满意度'] == '一般'][
                                                                                             df[df['结果满意度'] == '一般'][
                                                                                                 '案件大类'] == i][
                                                                                             'year(发现时间)'] == j][
                                                                                         '街镇'] == n]['数量'].sum() +
                                                         df[df['结果满意度'] == '基本满意'][
                                                             df[df['结果满意度'] == '基本满意']['案件大类'] == i][
                                                             df[df['结果满意度'] == '基本满意'][
                                                                 df[df['结果满意度'] == '基本满意']['案件大类'] == i][
                                                                 'year(发现时间)'] == j][df[df['结果满意度'] == '基本满意'][
                                                                                         df[df['结果满意度'] == '基本满意'][
                                                                                             '案件大类'] == i][
                                                                                         df[df['结果满意度'] == '基本满意'][
                                                                                             df[df['结果满意度'] == '基本满意'][
                                                                                                 '案件大类'] == i][
                                                                                             'year(发现时间)'] == j][
                                                                                         '街镇'] == n]['数量'].sum() +
                                                         df[df['结果满意度'] == '满意'][df[df['结果满意度'] == '满意']['案件大类'] == i][
                                                             df[df['结果满意度'] == '满意'][
                                                                 df[df['结果满意度'] == '满意']['案件大类'] == i][
                                                                 'year(发现时间)'] == j][df[df['结果满意度'] == '满意'][
                                                                                         df[df['结果满意度'] == '满意'][
                                                                                             '案件大类'] == i][
                                                                                         df[df['结果满意度'] == '满意'][
                                                                                             df[df['结果满意度'] == '满意'][
                                                                                                 '案件大类'] == i][
                                                                                             'year(发现时间)'] == j][
                                                                                         '街镇'] == n]['数量'].sum() +
                                                         df[df['结果满意度'] == '不满意'][
                                                             df[df['结果满意度'] == '不满意']['案件大类'] == i][
                                                             df[df['结果满意度'] == '不满意'][
                                                                 df[df['结果满意度'] == '不满意']['案件大类'] == i][
                                                                 'year(发现时间)'] == j][df[df['结果满意度'] == '不满意'][
                                                                                         df[df['结果满意度'] == '不满意'][
                                                                                             '案件大类'] == i][
                                                                                         df[df['结果满意度'] == '不满意'][
                                                                                             df[df['结果满意度'] == '不满意'][
                                                                                                 '案件大类'] == i][
                                                                                             'year(发现时间)'] == j][
                                                                                         '街镇'] == n]['数量'].sum())
                list1.append([j, n, i, a])

    df_final = pd.DataFrame(list1)

    df_final.columns = ['年份', '街道', '因素', '满意度']

    gp = df_final.groupby(['年份', '街道'])

    df_final.loc[:, '幸福指数'] = 1

    list_manyi = gp.agg(np.average)['满意度'].tolist()

    list2 = []
    for i in list_manyi:
        for j in range(6):
            list2.append(i)

    df_final['幸福指数'] = list2

    df_final1 = pd.pivot_table(df_final, index=['年份', '街道', '幸福指数'], columns=['因素'])

    df_final1 = df_final1.reset_index()

    df_final1.columns = ['年份', '街镇', '幸福', '环境保护', '民生保障', '社会服务', '安全管理', '文化生活', '经济发展']

    df_final1['幸福指数'] = df_final1['幸福']

    df_final1.drop('幸福', axis=1, inplace=True)

    df_final1.columns = ['datayear', 'street', 'hjbh', 'msbz', 'shfw', 'aqgl', 'whsh', 'jjfz', 'xfzs']

    df_year = pd.pivot_table(df_final1, index=['datayear']).reset_index()

    df_year = df_year.reindex(columns=['datayear', 'street', 'hjbh', 'msbz', 'shfw', 'aqgl', 'whsh', 'jjfz', 'xfzs'],
                              fill_value='全区')

    df_final1 = pd.concat([df_final1, df_year])

    df_final1 = df_final1.reindex(
        columns=['datayear', 'street', 'hjbh', 'msbz', 'shfw', 'aqgl', 'whsh', 'jjfz', 'xfzs'])

    df_final1.sort_values('datayear', inplace=True)

    df_yearxfzs = pd.pivot_table(df_final1, index=['datayear']).reset_index().drop(
        ['hjbh', 'msbz', 'shfw', 'aqgl', 'whsh', 'jjfz'], axis=1)
    df_yearxfzs['xfzs'] = round(df_yearxfzs['xfzs'] * 100)
    df_yearxfzs
    df1[0] = pd.to_datetime(df1[0])



    df1.columns = ['时间', '结果满意度', '案件大类', '街镇', '数量']

    df1.dropna(subset=["案件大类", "结果满意度"], inplace=True)
    df1=df1.sort_values('时间')
    df1['案件大类'].loc[df1[df1['案件大类'] == '国有档案']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '个人档案']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '商业服务']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '工商监管']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '工商信息']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '违法经营']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '合作交流']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '服务质量']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '旅游纠纷']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '旅游信息']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '生活保障']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '救灾赈灾']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '优抚安置']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '社区家政']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '养老保障']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '慈善福利']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '殡葬事业']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '婚姻管理']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '寺庙管理']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '宗教信仰']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '侨务工作']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '统战工作']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '就业创业']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '劳动保护']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '社保信息']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '劳动人事制度']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '医疗医保']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '工伤']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '津贴补助']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '社会保险']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '外事工作']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '知识产权']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '道路维护']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '公共道路']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '工程管理']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '违法建筑']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '燃气行业监管']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '污染']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '夜间施工许可']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '驾驶培训']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '车辆拍卖']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '公交巴士']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '铁路客运']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '地铁客运']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '出租车']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '港船客运']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '航空客运']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '汽车客运']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '货物运输']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '汽车维修']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '公共交通用卡管理']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '停车管理']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '口岸协调']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '口岸信息']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '禽类饲养']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '环境卫生']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '城市管理']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '市容市貌']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '绿地绿化']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '动植园林']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '民防工程']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '防灾抗灾']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '水资源管理']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '排水排污管理']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '河道流域管理']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '城市建设用地管理']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '非城市建设用地管理']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '建设管理']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '土地资源管理']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '房屋权属']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '旧房改造']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '保障型住房']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '物业服务管理']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '市场交易管理']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '征收管理']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '住房病虫害']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '物业相关执法']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '财政工作']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '改革规划']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '价格调控']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '国资']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '金融']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '经济信息化']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '村队管理']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '农业生产']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '动植物防疫']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '农民负担']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '商务']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '审计工作']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '税收政策']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '税收管理']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '统计工作']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '招生考试']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '学校管理']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '学生负担']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '入学入托']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '科技开发']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '科技管理']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '体育管理']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '医院监管']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '卫生信息']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '医疗服务']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '特定医疗机构']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '人口计生']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '广播影视']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '文化产业管理']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '文化遗产保护']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '新闻报道']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '刊物市场监管']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '法院受理']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '法院信息']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '护照办理']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '签证签注']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '出境咨询']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '行政管理']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '消防管理']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '消防设备维护']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '审批许可']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '社会噪声']['案件大类'].index] = '环境保护'
    df1['案件大类'].loc[df1[df1['案件大类'] == '交通管理']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '户籍管理']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '犬类管理']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '社会治安']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '特种行业管理']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '国家安全']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '检察院受理']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '法律服务']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '公证服务']['案件大类'].index] = '文化生活'
    df1['案件大类'].loc[df1[df1['案件大类'] == '纠纷仲裁']['案件大类'].index] = '经济发展'
    df1['案件大类'].loc[df1[df1['案件大类'] == '司法直属']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '故障报修']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '限电管理']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '用电计费']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '电力服务']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '违规用电']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '供水报修']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '自来水水质']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '供水计费']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '供水服务']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '违规用水']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '气象预报']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '气象预警']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '燃气报修']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '燃气计费']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '燃气服务']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '通信']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '邮政服务']['案件大类'].index] = '民生保障'
    df1['案件大类'].loc[df1[df1['案件大类'] == '妇联']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '其他社团']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '团市委']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '总工会']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '安全生产']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '职业健康']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '安全管理']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '广告审批']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '申诉举报']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '计量器具检测']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '生产许可证管理']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '特种设备监察']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '组织机构代码证']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '质量认证']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '表扬感谢']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '投诉批评']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '意见建议']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '传真信息']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '12345热线']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '表扬承办部门']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '批评承办部门']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '部队']['案件大类'].index] = '安全管理'
    df1['案件大类'].loc[df1[df1['案件大类'] == '残联']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '工青妇工作']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '机关事务管理']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '纪检监查']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '政风行风']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '无效电话']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '涉港澳台']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '其他']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '咨询信访渠道']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '查询办理进度']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '复查复核']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '事项办理']['案件大类'].index] = '社会服务'
    df1['案件大类'].loc[df1[df1['案件大类'] == '中央直属']['案件大类'].index] = '社会服务'

    df1.drop(df1[df1['结果满意度'] == '未表态'].index, inplace=True)

    df1.drop(df1[df1['时间'] == '2017-12'].index, inplace=True)

    list_street = ['五里桥街道', '半淞园街道', '南京东路街道', '外滩街道', '小东门街道', '打浦桥街道', '淮海中路街道', '瑞金二路街道', '老西门街道', '豫园街道']
    
    df1_threemonth = df1[(df1['时间'].iloc[-1] - df1['时间']) <= timedelta(days=90, hours=0, minutes=0, seconds=0)]
    df1_oneyear = df1[(df1['时间'].iloc[-1] - df1['时间']) > timedelta(days=90, hours=0, minutes=0, seconds=0)][(df1['时间'].iloc[-1] -df1[(df1['时间'].iloc[-1] -df1['时间']) > timedelta(days=90,hours=0,minutes=0,seconds=0)]['时间']) < timedelta(days=365, hours=0, minutes=0, seconds=0)]
    df1_years = df1[(df1['时间'].iloc[-1] - df1['时间']) >= timedelta(days=365, hours=0, minutes=0, seconds=0)]
    
    list1 = []
    for i in list_:
        for j in list_street:
            a = (df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '满意'][
                     df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '满意']['案件大类'] == i][
                     '数量'].sum() * 1 +
                 df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '基本满意'][
                     df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '基本满意']['案件大类'] == i][
                     '数量'].sum() * 0.8 +
                 df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '不满意'][
                     df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '不满意']['案件大类'] == i][
                     '数量'].sum() * 0 +
                 df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '一般'][
                     df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '一般']['案件大类'] == i][
                     '数量'].sum() * 0.6) / (
                            df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '满意'][
                                df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '满意'][
                                    '案件大类'] == i]['数量'].sum() +
                            df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '基本满意'][
                                df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '基本满意'][
                                    '案件大类'] == i]['数量'].sum() +
                            df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '不满意'][
                                df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '不满意'][
                                    '案件大类'] == i]['数量'].sum() +
                            df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '一般'][
                                df1_years[df1_years['街镇'] == j][df1_years[df1_years['街镇'] == j]['结果满意度'] == '一般'][
                                    '案件大类'] == i]['数量'].sum())
            list1.append([j, i, a])

    list3 = []
    for i in list_:
        for j in list_street:
            a = (df1_threemonth[df1_threemonth['街镇'] == j][df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '满意'][
                     df1_threemonth[df1_threemonth['街镇'] == j][
                         df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '满意']['案件大类'] == i]['数量'].sum() * 1 +
                 df1_threemonth[df1_threemonth['街镇'] == j][
                     df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '基本满意'][
                     df1_threemonth[df1_threemonth['街镇'] == j][
                         df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '基本满意']['案件大类'] == i]['数量'].sum() * 0.8 +
                 df1_threemonth[df1_threemonth['街镇'] == j][df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '不满意'][
                     df1_threemonth[df1_threemonth['街镇'] == j][
                         df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '不满意']['案件大类'] == i]['数量'].sum() * 0 +
                 df1_threemonth[df1_threemonth['街镇'] == j][df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '一般'][
                     df1_threemonth[df1_threemonth['街镇'] == j][
                         df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '一般']['案件大类'] == i][
                     '数量'].sum() * 0.6) / (df1_threemonth[df1_threemonth['街镇'] == j][
                                               df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '满意'][
                                               df1_threemonth[df1_threemonth['街镇'] == j][
                                                   df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '满意'][
                                                   '案件大类'] == i]['数量'].sum() +
                                           df1_threemonth[df1_threemonth['街镇'] == j][
                                               df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '基本满意'][
                                               df1_threemonth[df1_threemonth['街镇'] == j][
                                                   df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '基本满意'][
                                                   '案件大类'] == i]['数量'].sum() +
                                           df1_threemonth[df1_threemonth['街镇'] == j][
                                               df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '不满意'][
                                               df1_threemonth[df1_threemonth['街镇'] == j][
                                                   df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '不满意'][
                                                   '案件大类'] == i]['数量'].sum() +
                                           df1_threemonth[df1_threemonth['街镇'] == j][
                                               df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '一般'][
                                               df1_threemonth[df1_threemonth['街镇'] == j][
                                                   df1_threemonth[df1_threemonth['街镇'] == j]['结果满意度'] == '一般'][
                                                   '案件大类'] == i]['数量'].sum())
            list3.append([j, i, a])

    list2 = []
    for i in list_:
        for j in list_street:
            a = (df1_oneyear[df1_oneyear['街镇'] == j][df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '满意'][
                     df1_oneyear[df1_oneyear['街镇'] == j][df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '满意'][
                         '案件大类'] == i]['数量'].sum() * 1 +
                 df1_oneyear[df1_oneyear['街镇'] == j][df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '基本满意'][
                     df1_oneyear[df1_oneyear['街镇'] == j][df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '基本满意'][
                         '案件大类'] == i]['数量'].sum() * 0.8 +
                 df1_oneyear[df1_oneyear['街镇'] == j][df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '不满意'][
                     df1_oneyear[df1_oneyear['街镇'] == j][df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '不满意'][
                         '案件大类'] == i]['数量'].sum() * 0 +
                 df1_oneyear[df1_oneyear['街镇'] == j][df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '一般'][
                     df1_oneyear[df1_oneyear['街镇'] == j][df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '一般'][
                         '案件大类'] == i]['数量'].sum() * 0.6) / (
                            df1_oneyear[df1_oneyear['街镇'] == j][df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '满意'][
                                df1_oneyear[df1_oneyear['街镇'] == j][
                                    df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '满意']['案件大类'] == i]['数量'].sum() +
                            df1_oneyear[df1_oneyear['街镇'] == j][df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '基本满意'][
                                df1_oneyear[df1_oneyear['街镇'] == j][
                                    df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '基本满意']['案件大类'] == i]['数量'].sum() +
                            df1_oneyear[df1_oneyear['街镇'] == j][df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '不满意'][
                                df1_oneyear[df1_oneyear['街镇'] == j][
                                    df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '不满意']['案件大类'] == i]['数量'].sum() +
                            df1_oneyear[df1_oneyear['街镇'] == j][df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '一般'][
                                df1_oneyear[df1_oneyear['街镇'] == j][
                                    df1_oneyear[df1_oneyear['街镇'] == j]['结果满意度'] == '一般']['案件大类'] == i]['数量'].sum())
            list2.append([j, i, a])

    df13 = pd.DataFrame(list3)
    df12 = pd.DataFrame(list2)
    df11 = pd.DataFrame(list1)
    df13.fillna(df13[2].mean(), inplace=True)
    df12.fillna(df12[2].mean(), inplace=True)
    df11.fillna(df11[2].mean(), inplace=True)

    df1123 = pd.pivot_table(df13, index=[0], columns=[1]) * 0.6 + pd.pivot_table(df12, index=[0],columns=[1]) * 0.3 + pd.pivot_table(df11, index=[0], columns=[1]) * 0.1

    list_mean = []
    for i in range(10):
        a = df1123.iloc[i, :-1].mean()
        list_mean.append(a)

    df1123['幸福指数'] = list_mean

    df1123.reset_index(inplace=True)

    df1123.loc[10] = ['全区', df1123.iloc[:, 1].mean(), df1123.iloc[:, 2].mean(), df1123.iloc[:, 3].mean(),
                      df1123.iloc[:, 4].mean(), df1123.iloc[:, 5].mean(), df1123.iloc[:, 6].mean(), (
                                  df1123.iloc[:, 1].mean() + df1123.iloc[:, 2].mean() + df1123.iloc[:,
                                                                                        3].mean() + df1123.iloc[:,
                                                                                                    4].mean() + df1123.iloc[
                                                                                                                :,
                                                                                                                5].mean() + df1123.iloc[
                                                                                                                            :,
                                                                                                                            6].mean()) / 6]

    df1123.columns = ['street', 'hjbh', 'msbz', 'shfw', 'aqgl', 'whsh', 'jjfz', 'xfzs']

    df1123 = df1123.reindex(columns=['year', 'street', 'hjbh', 'msbz', 'shfw', 'aqgl', 'whsh', 'jjfz', 'xfzs'],
                            fill_value='全年')


    df_final_total = df1123.drop('year', axis=1)
    df_final_total = pd.concat([df_final_total[['street']], round(df_final_total.iloc[:, 1:] * 100, 0)], axis=1)
    df_final_total=df_final_total.reindex(columns=['street','hjbh','msbz','shfw','aqgl','whsh','jjfz','xfzs'])

    return  df_final_total